[Survived] BlockStatement
routes/auth.js:5:37
 const express = require('express');
 const router = express.Router();
 
-router.post('/login', (req, res) => {
-  // Toy: trust username param. Real prod = bcrypt + JWT issue.
-  const { user } = req.body;
-  if (!user) return res.status(400).json({ error: 'missing user' });
-  res.json({ token: `Bearer t${user[0] || 'a'}` });
-});
+router.post('/login', (req, res) => {});
 
 module.exports = router;

[Survived] StringLiteral
routes/auth.js:5:13
 const express = require('express');
 const router = express.Router();
 
-router.post('/login', (req, res) => {
+router.post("", (req, res) => {
   // Toy: trust username param. Real prod = bcrypt + JWT issue.
   const { user } = req.body;

[Survived] ConditionalExpression
routes/auth.js:8:7
 router.post('/login', (req, res) => {
   // Toy: trust username param. Real prod = bcrypt + JWT issue.
   const { user } = req.body;
-  if (!user) return res.status(400).json({ error: 'missing user' });
+  if (true) return res.status(400).json({ error: 'missing user' });
   res.json({ token: `Bearer t${user[0] || 'a'}` });
 });

[Survived] BooleanLiteral
routes/auth.js:8:7
 router.post('/login', (req, res) => {
   // Toy: trust username param. Real prod = bcrypt + JWT issue.
   const { user } = req.body;
-  if (!user) return res.status(400).json({ error: 'missing user' });
+  if (user) return res.status(400).json({ error: 'missing user' });
   res.json({ token: `Bearer t${user[0] || 'a'}` });
 });

[Survived] ConditionalExpression
routes/auth.js:9:32
   // Toy: trust username param. Real prod = bcrypt + JWT issue.
   const { user } = req.body;
   if (!user) return res.status(400).json({ error: 'missing user' });
-  res.json({ token: `Bearer t${user[0] || 'a'}` });
+  res.json({ token: `Bearer t${true}` });
 });
 

[Survived] ConditionalExpression
routes/auth.js:9:32
   // Toy: trust username param. Real prod = bcrypt + JWT issue.
   const { user } = req.body;
   if (!user) return res.status(400).json({ error: 'missing user' });
-  res.json({ token: `Bearer t${user[0] || 'a'}` });
+  res.json({ token: `Bearer t${false}` });
 });
 
