[Killed] ConditionalExpression
db.js:6:17
 const path = require('path');
 const fs = require('fs');
 
-const DB_PATH = process.env.DB_URL || path.join(__dirname, '../.toy-test.db');
+const DB_PATH = false;
 const db = new Database(DB_PATH);
 
killedBy: All tests
statusReason: > toy-project@0.0.1 test
> node --test tests/*.test.js


✖ orders module loads (27.519375ms)

✔ items insert math (0.080083ms)

[Killed] ConditionalExpression
db.js:6:17
 const path = require('path');
 const fs = require('fs');
 
-const DB_PATH = process.env.DB_URL || path.join(__dirname, '../.toy-test.db');
+const DB_PATH = true;
 const db = new Database(DB_PATH);
 
killedBy: All tests
statusReason: > toy-project@0.0.1 test
> node --test tests/*.test.js


✖ orders module loads (27.38425ms)

✔ items insert math (0.082084ms)

[Survived] BlockStatement
db.js:9:19
 const DB_PATH = process.env.DB_URL || path.join(__dirname, '../.toy-test.db');
 const db = new Database(DB_PATH);
 
-function initDb() {
-  const schema = fs.readFileSync(path.join(__dirname, '../schema/init.sql'), 'utf8');
-  db.exec(schema);
-}
+function initDb() {}
 
 module.exports = { db, initDb };

[Survived] ObjectLiteral
db.js:14:18
   db.exec(schema);
 }
 
-module.exports = { db, initDb };
+module.exports = {};
 
