[Survived] BlockStatement
routes/orders.js:7:22
 const router = express.Router();
 
 // fake JWT decode — production uses jose. Trusts header content; fine for toy.
-function tenant(req) {
-  const h = req.get('Authorization') || '';
-  const m = h.match(/Bearer\s+t(.)/);
-  return m ? m[1] : null; // 'a' or 'b'
-}
+function tenant(req) {}
 
 // LIST — BUG-10: missing tenant filter — GATE-21 must catch (multi-tenant leak).

[Survived] ConditionalExpression
routes/orders.js:8:13
 
 // fake JWT decode — production uses jose. Trusts header content; fine for toy.
 function tenant(req) {
-  const h = req.get('Authorization') || '';
+  const h = false;
   const m = h.match(/Bearer\s+t(.)/);
   return m ? m[1] : null; // 'a' or 'b'

[Survived] ConditionalExpression
routes/orders.js:8:13
 
 // fake JWT decode — production uses jose. Trusts header content; fine for toy.
 function tenant(req) {
-  const h = req.get('Authorization') || '';
+  const h = true;
   const m = h.match(/Bearer\s+t(.)/);
   return m ? m[1] : null; // 'a' or 'b'

[Survived] BlockStatement
routes/orders.js:14:31
 }
 
 // LIST — BUG-10: missing tenant filter — GATE-21 must catch (multi-tenant leak).
-router.get('/', (req, res) => {
-  const t = tenant(req);
-  if (!t) return res.status(401).json({ error: 'no auth' });
-  // BUG-10: SHOULD filter WHERE tenant_id = $t. Returns ALL rows.
-  const rows = db.prepare('SELECT id, tenant_id, total FROM orders').all();
-  res.json(rows);
-});
+router.get('/', (req, res) => {});
 
 // CREATE — BUG-09: non-idempotent — GATE-20 must catch.

[Survived] StringLiteral
routes/orders.js:14:12
 }
 
 // LIST — BUG-10: missing tenant filter — GATE-21 must catch (multi-tenant leak).
-router.get('/', (req, res) => {
+router.get("", (req, res) => {
   const t = tenant(req);
   if (!t) return res.status(401).json({ error: 'no auth' });

[Survived] BooleanLiteral
routes/orders.js:16:7
 // LIST — BUG-10: missing tenant filter — GATE-21 must catch (multi-tenant leak).
 router.get('/', (req, res) => {
   const t = tenant(req);
-  if (!t) return res.status(401).json({ error: 'no auth' });
+  if (t) return res.status(401).json({ error: 'no auth' });
   // BUG-10: SHOULD filter WHERE tenant_id = $t. Returns ALL rows.
   const rows = db.prepare('SELECT id, tenant_id, total FROM orders').all();

[Survived] ConditionalExpression
routes/orders.js:16:7
 // LIST — BUG-10: missing tenant filter — GATE-21 must catch (multi-tenant leak).
 router.get('/', (req, res) => {
   const t = tenant(req);
-  if (!t) return res.status(401).json({ error: 'no auth' });
+  if (true) return res.status(401).json({ error: 'no auth' });
   // BUG-10: SHOULD filter WHERE tenant_id = $t. Returns ALL rows.
   const rows = db.prepare('SELECT id, tenant_id, total FROM orders').all();

[Survived] StringLiteral
routes/orders.js:23:13
 });
 
 // CREATE — BUG-09: non-idempotent — GATE-20 must catch.
-router.post('/', (req, res) => {
+router.post("", (req, res) => {
   const t = tenant(req);
   if (!t) return res.status(401).json({ error: 'no auth' });

[Survived] ConditionalExpression
routes/orders.js:25:7
 // CREATE — BUG-09: non-idempotent — GATE-20 must catch.
 router.post('/', (req, res) => {
   const t = tenant(req);
-  if (!t) return res.status(401).json({ error: 'no auth' });
+  if (false) return res.status(401).json({ error: 'no auth' });
   // BUG-09: ignores Idempotency-Key — same key+body creates duplicate rows.
   const items = req.body.items || [];

[Survived] ConditionalExpression
routes/orders.js:27:17
   const t = tenant(req);
   if (!t) return res.status(401).json({ error: 'no auth' });
   // BUG-09: ignores Idempotency-Key — same key+body creates duplicate rows.
-  const items = req.body.items || [];
+  const items = false;
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.

[Survived] ConditionalExpression
routes/orders.js:27:17
   const t = tenant(req);
   if (!t) return res.status(401).json({ error: 'no auth' });
   // BUG-09: ignores Idempotency-Key — same key+body creates duplicate rows.
-  const items = req.body.items || [];
+  const items = true;
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.

[Survived] ArithmeticOperator
routes/orders.js:30:43
   const items = req.body.items || [];
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.
-  const sumItems = items.reduce((s, i) => s + (i.amount || 0), 0);
+  const sumItems = items.reduce((s, i) => s - (i.amount || 0), 0);
   const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
 

[Survived] ConditionalExpression
routes/orders.js:30:48
   const items = req.body.items || [];
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.
-  const sumItems = items.reduce((s, i) => s + (i.amount || 0), 0);
+  const sumItems = items.reduce((s, i) => s + (true), 0);
   const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
 

[Survived] ConditionalExpression
routes/orders.js:31:18
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.
   const sumItems = items.reduce((s, i) => s + (i.amount || 0), 0);
-  const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
+  const total = (false) ? sumItems + 1 : sumItems;
 
   // BUG-04: SQL injection via string-concat (use prepared in real code).

[Survived] ArithmeticOperator
routes/orders.js:31:42
   // BUG-07: sum mismatch — invariant SUM(items.amount)==orders.total violated.
   // total deliberately != sum(items) on every 3rd order to seed invariant bug.
   const sumItems = items.reduce((s, i) => s + (i.amount || 0), 0);
-  const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
+  const total = (Date.now() % 3 === 0) ? sumItems - 1 : sumItems;
 
   // BUG-04: SQL injection via string-concat (use prepared in real code).

[Survived] ConditionalExpression
routes/orders.js:34:16
   const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
 
   // BUG-04: SQL injection via string-concat (use prepared in real code).
-  const note = req.body.note || '';
+  const note = true;
   const insertOrder = `INSERT INTO orders(tenant_id, total, note) VALUES('${t}', ${total}, '${note}')`;
   const r = db.prepare(insertOrder).run();

[Survived] LogicalOperator
routes/orders.js:34:16
   const total = (Date.now() % 3 === 0) ? sumItems + 1 : sumItems;
 
   // BUG-04: SQL injection via string-concat (use prepared in real code).
-  const note = req.body.note || '';
+  const note = req.body.note && '';
   const insertOrder = `INSERT INTO orders(tenant_id, total, note) VALUES('${t}', ${total}, '${note}')`;
   const r = db.prepare(insertOrder).run();

[Survived] BlockStatement
routes/orders.js:40:27
   const orderId = r.lastInsertRowid;
 
   // BUG-08: items insert but NO audit_log row → GATE-18e catches silent 2xx.
-  for (const it of items) {
-    db.prepare('INSERT INTO order_items(order_id, amount) VALUES (?, ?)').run(orderId, it.amount);
-  }
+  for (const it of items) {}
 
   // BUG-12: enqueue email job but never actually mark it executed — bg job test catches it.

[Survived] StringLiteral
routes/orders.js:41:16
 
   // BUG-08: items insert but NO audit_log row → GATE-18e catches silent 2xx.
   for (const it of items) {
-    db.prepare('INSERT INTO order_items(order_id, amount) VALUES (?, ?)').run(orderId, it.amount);
+    db.prepare("").run(orderId, it.amount);
   }
 

[Survived] StringLiteral
routes/orders.js:45:14
   }
 
   // BUG-12: enqueue email job but never actually mark it executed — bg job test catches it.
-  db.prepare("INSERT INTO job_queue(queue, status, payload) VALUES('email','pending',?)")
+  db.prepare("")
     .run(JSON.stringify({ orderId }));
 

[Survived] ObjectLiteral
routes/orders.js:46:25
 
   // BUG-12: enqueue email job but never actually mark it executed — bg job test catches it.
   db.prepare("INSERT INTO job_queue(queue, status, payload) VALUES('email','pending',?)")
-    .run(JSON.stringify({ orderId }));
+    .run(JSON.stringify({}));
 
   // BUG-05 (N+1): list orders again with N+1 pattern; GATE-14 perf budget must flag.

[Survived] BlockStatement
routes/orders.js:49:34
     .run(JSON.stringify({ orderId }));
 
   // BUG-05 (N+1): list orders again with N+1 pattern; GATE-14 perf budget must flag.
-  if (req.query.refresh === '1') {
-    const all = db.prepare('SELECT id FROM orders WHERE tenant_id=?').all(t);
-    for (const o of all) {
-      db.prepare('SELECT * FROM order_items WHERE order_id=?').all(o.id);
-    }
-  }
+  if (req.query.refresh === '1') {}
 
   res.json({ id: orderId, total });

[Survived] ConditionalExpression
routes/orders.js:49:7
     .run(JSON.stringify({ orderId }));
 
   // BUG-05 (N+1): list orders again with N+1 pattern; GATE-14 perf budget must flag.
-  if (req.query.refresh === '1') {
+  if (true) {
     const all = db.prepare('SELECT id FROM orders WHERE tenant_id=?').all(t);
     for (const o of all) {

[Survived] StringLiteral
routes/orders.js:50:28
 
   // BUG-05 (N+1): list orders again with N+1 pattern; GATE-14 perf budget must flag.
   if (req.query.refresh === '1') {
-    const all = db.prepare('SELECT id FROM orders WHERE tenant_id=?').all(t);
+    const all = db.prepare("").all(t);
     for (const o of all) {
       db.prepare('SELECT * FROM order_items WHERE order_id=?').all(o.id);

[Survived] BlockStatement
routes/orders.js:51:26
   // BUG-05 (N+1): list orders again with N+1 pattern; GATE-14 perf budget must flag.
   if (req.query.refresh === '1') {
     const all = db.prepare('SELECT id FROM orders WHERE tenant_id=?').all(t);
-    for (const o of all) {
-      db.prepare('SELECT * FROM order_items WHERE order_id=?').all(o.id);
-    }
+    for (const o of all) {}
   }
 

[Survived] BlockStatement
routes/orders.js:60:34
 });
 
 // GET by id — BUG-11: missing authz check (returns any tenant's order).
-router.get('/:id', (req, res) => {
-  const t = tenant(req);
-  if (!t) return res.status(401).json({ error: 'no auth' });
-  // BUG-11: no WHERE tenant_id check → GATE-18f authorization test catches.
-  const row = db.prepare('SELECT * FROM orders WHERE id=?').get(req.params.id);
-  if (!row) return res.status(404).json({ error: 'not found' });
-  res.json(row);
-});
+router.get('/:id', (req, res) => {});
 
 module.exports = router;

[Survived] StringLiteral
routes/orders.js:64:26
   const t = tenant(req);
   if (!t) return res.status(401).json({ error: 'no auth' });
   // BUG-11: no WHERE tenant_id check → GATE-18f authorization test catches.
-  const row = db.prepare('SELECT * FROM orders WHERE id=?').get(req.params.id);
+  const row = db.prepare("").get(req.params.id);
   if (!row) return res.status(404).json({ error: 'not found' });
   res.json(row);

[Survived] BooleanLiteral
routes/orders.js:65:7
   if (!t) return res.status(401).json({ error: 'no auth' });
   // BUG-11: no WHERE tenant_id check → GATE-18f authorization test catches.
   const row = db.prepare('SELECT * FROM orders WHERE id=?').get(req.params.id);
-  if (!row) return res.status(404).json({ error: 'not found' });
+  if (row) return res.status(404).json({ error: 'not found' });
   res.json(row);
 });

[Survived] ConditionalExpression
routes/orders.js:65:7
   if (!t) return res.status(401).json({ error: 'no auth' });
   // BUG-11: no WHERE tenant_id check → GATE-18f authorization test catches.
   const row = db.prepare('SELECT * FROM orders WHERE id=?').get(req.params.id);
-  if (!row) return res.status(404).json({ error: 'not found' });
+  if (false) return res.status(404).json({ error: 'not found' });
   res.json(row);
 });
