[Survived] StringLiteral
server.js:19:9
 // (deliberately no morgan/pino — observability gap)
 
 app.use('/api/orders', ordersRouter);
-app.use('/api/auth', authRouter);
+app.use("", authRouter);
 
 // admin queue depth endpoint for GATE-18d

[Survived] BlockStatement
server.js:22:52
 app.use('/api/auth', authRouter);
 
 // admin queue depth endpoint for GATE-18d
-app.get('/admin/queues/:name/depth', (req, res) => {
-  const row = db.prepare("SELECT count(*) AS c FROM job_queue WHERE queue=? AND status='pending'").get(req.params.name);
-  res.json(row.c);
-});
+app.get('/admin/queues/:name/depth', (req, res) => {});
 
 // chaos middleware honoring X-Chaos-Inject for GATE-18c tests

[Survived] StringLiteral
server.js:22:9
 app.use('/api/auth', authRouter);
 
 // admin queue depth endpoint for GATE-18d
-app.get('/admin/queues/:name/depth', (req, res) => {
+app.get("", (req, res) => {
   const row = db.prepare("SELECT count(*) AS c FROM job_queue WHERE queue=? AND status='pending'").get(req.params.name);
   res.json(row.c);

[Survived] ArrowFunction
server.js:28:20
 });
 
 // chaos middleware honoring X-Chaos-Inject for GATE-18c tests
-app.locals.chaos = (point) => (req, _res, next) => {
-  if (req.get('X-Chaos-Inject') === point) {
-    const err = new Error('chaos: ' + point);
-    err.chaos = true;
-    return next(err);
-  }
-  next();
-};
+app.locals.chaos = () => undefined;
 
 app.use((err, _req, res, _next) => {

[Survived] BlockStatement
server.js:28:52
 });
 
 // chaos middleware honoring X-Chaos-Inject for GATE-18c tests
-app.locals.chaos = (point) => (req, _res, next) => {
-  if (req.get('X-Chaos-Inject') === point) {
-    const err = new Error('chaos: ' + point);
-    err.chaos = true;
-    return next(err);
-  }
-  next();
-};
+app.locals.chaos = (point) => (req, _res, next) => {};
 
 app.use((err, _req, res, _next) => {

[Survived] ConditionalExpression
server.js:29:7
 
 // chaos middleware honoring X-Chaos-Inject for GATE-18c tests
 app.locals.chaos = (point) => (req, _res, next) => {
-  if (req.get('X-Chaos-Inject') === point) {
+  if (true) {
     const err = new Error('chaos: ' + point);
     err.chaos = true;

[Survived] EqualityOperator
server.js:29:7
 
 // chaos middleware honoring X-Chaos-Inject for GATE-18c tests
 app.locals.chaos = (point) => (req, _res, next) => {
-  if (req.get('X-Chaos-Inject') === point) {
+  if (req.get('X-Chaos-Inject') !== point) {
     const err = new Error('chaos: ' + point);
     err.chaos = true;

[Survived] BooleanLiteral
server.js:31:17
 app.locals.chaos = (point) => (req, _res, next) => {
   if (req.get('X-Chaos-Inject') === point) {
     const err = new Error('chaos: ' + point);
-    err.chaos = true;
+    err.chaos = false;
     return next(err);
   }

[Survived] BlockStatement
server.js:37:36
   next();
 };
 
-app.use((err, _req, res, _next) => {
-  // BUG-13 partial: error message leaks key on certain paths (security smell)
-  res.status(err.chaos ? 500 : 500).json({ error: err.message });
-});
+app.use((err, _req, res, _next) => {});
 
 if (require.main === module) {

[Survived] ConditionalExpression
server.js:44:16
 
 if (require.main === module) {
   initDb();
-  const port = process.env.PORT || 3000;
+  const port = false;
   app.listen(port, () => console.log(`toy backend on ${port}`));
 }

[Survived] ConditionalExpression
server.js:44:16
 
 if (require.main === module) {
   initDb();
-  const port = process.env.PORT || 3000;
+  const port = true;
   app.listen(port, () => console.log(`toy backend on ${port}`));
 }

[Survived] ArrowFunction
server.js:45:20
 if (require.main === module) {
   initDb();
   const port = process.env.PORT || 3000;
-  app.listen(port, () => console.log(`toy backend on ${port}`));
+  app.listen(port, () => undefined);
 }
 
